[{"id":"default-slice","name":"Default slice","docURL":"...","version":"sktwi1xtmkfgx8626","description":"TechAbout","primary":{"title":[{"type":"heading1","text":"morph end-to-end e-commerce","spans":[]}],"description":[{"type":"paragraph","text":"aggregate magnetic e-tailers","spans":[]}]},"items":[{"sectionTitle":[{"type":"heading1","text":"Creating Polaroid Style Photos","spans":[]}],"details":[{"type":"heading1","text":"I wanted to create polaroid style photos. They are actually pretty simple to make, you can just add padding around the photo, but the key is that on the bottom the padding needs to be larger.  You can certainly use css to do this, but I wanted to do this with imgix so the image that is indexed later in google still looks like this.  I set a general padding number, then a larger pad-bottom number, and then declared what color I wanted these padded areas to be. Below is the imgix API I used to create the padding to make it look like a polaroid photo:","spans":[]}],"code":[{"type":"heading1","text":"pad-bottom=75&pad=10&bg=E8E8EB","spans":[]}],"thumb":{"dimensions":{"width":900,"height":500},"alt":"Placeholder image","copyright":null,"url":"https://images.prismic.io/missingkids/c670e6b4-5274-4094-b025-15b6ce69f223_polaroid.jpg?"}},{"sectionTitle":[{"type":"heading1","text":"Text as Part of the Image for Indexing","spans":[]}],"details":[{"type":"heading1","text":"It was important for me to create an image that not only contained the image of the missing child, but I wanted the image to also contain important text such as name, location, contact info.  I always though image for missing children should always contain this info, that way no matter where you see them, you will still see this important info. It's important to differentiate an image with text as part of the image and text placed on top of it using css. When an image is indexed in google, it loses the text placed on top with css, but images with text as part of the image will remain in a google indexed image.  I am creating a watermark in imgix in the bottom section of the polaroid, then I am filling the text from the prismic field in the slice called info. Here is an example:","spans":[]}],"code":[{"type":"heading1","text":"txt= + $prismic.asText(slice.primary.info)","spans":[]}],"thumb":{"dimensions":{"width":300,"height":400},"alt":"Placeholder image","copyright":null,"url":"https://images.prismic.io/missingkids/bcf43dba-baa4-4e77-8f96-edf0e6978b4e_missingimgcode.png?"}}],"slice_type":"tech_about"}]